[
    {
      "key": "street_trees",
      "value": "{\"id\":\"street_trees\",\"name\":\"Street Trees\",\"summary\":\"Trees located next to or within a public road, improving local environment and contributing significantly to Green Infrastructure (GI).\",\"sources\":\"IGNITION, NE GIDG 4.10, CIRIA C753 Ch 19, GI Design Guide\",\"benefits\":[{\"category\":\"Water Management\",\"text\":\"Interception & Evapotranspiration reduces runoff volume (C753 Box 19.1); Increased infiltration potential; Water Quality Improvement via filtration/uptake (C753 S19.5).\"},{\"category\":\"Climate Regulation\",\"text\":\"Local Air Temperature Reduction (Urban Cooling): 3°C; Shade provision reduces surface/building temperatures (GI Guide); Carbon Sequestered: 5.5 kg/tree/yr; Carbon Stored: 231.6 kg/tree.\"},{\"category\":\"Air Quality\",\"text\":\"Air Pollutant Removal (NO2, PM10, Ozone) - effectiveness varies with species/location (GI Guide).\"},{\"category\":\"Biodiversity\",\"text\":\"Provides habitat (food, shelter, nesting) for birds, invertebrates; Contributes to green corridors/ecological connectivity (C753 Ch 6; GI Guide).\"},{\"category\":\"Amenity & Well-being\",\"text\":\"Enhances streetscape aesthetics; Noise Reduction: 4 db/tree; Proven positive impact on mental health and well-being; Traffic calming effect (C753 Ch 5; GI Guide).\"},{\"category\":\"Economic Metrics\",\"text\":\"Property Value Uplift: 4.7%; Rental Value Uplift: 6.15%; Restaurant Patronage Increase: 30-50%.\"}],\"technicalGuidance\":[{\"heading\":\"Site Assessment & Location (C753 S19.2)\",\"content\":[\"Crucial to integrate tree planning early. Check thoroughly for underground utilities (gas, water, electric, comms using NJUG guidelines) and overhead lines. Assess available soil volume (essential for healthy growth - C753 S19.8.2), pavement construction, soil type/condition, drainage, sunlight, and wind exposure.\",\"Consider space for mature canopy/root spread, avoiding conflicts with buildings, traffic sightlines, lighting columns. Consult local authority highway regulations and tree strategies - permissions essential for planting in public highways/pavements (C753 Ch 9).\"]},{\"heading\":\"Species Selection (C753 S19.3; GI Guide - Planting)\",\"content\":[\"Choose UK-native or well-adapted non-native species appropriate for the specific urban location and constraints (paved environment, soil volume, air pollution, salt tolerance, pests/diseases, future climate resilience). Consider mature size/form (canopy spread, height - aim for large canopy where space permits), structural integrity, root characteristics (avoiding infrastructure damage), allergenicity, seasonal interest (flowers, fruit, colour), and contribution to local biodiversity goals (e.g., nectar source). Consult local authority tree strategies and TDAG guidance ('Right Tree, Right Place').\",\"Examples: Field Maple (Acer campestre), Hawthorn (Crataegus monogyna), Rowan (Sorbus aucuparia), Small-leaved Lime (Tilia cordata), Silver Birch (Betula pendula), Hornbeam (Carpinus betulus), Wild Cherry (Prunus avium).\"]},{\"heading\":\"Planting Pit Design & Soil Volume (C753 S19.2, S19.8; GI Guide - Soils)\",\"content\":[\"Maximise uncompacted rooting volume - CRITICAL for tree health, longevity, and delivery of benefits (TDAG recommends aiming for soil volumes related to target canopy size). Standard pits in soft landscape should be significantly larger than rootball (min 1m³, ideally 10-15m³+ for larger trees). For paved areas, use structural soil systems (C753 S19.2.1, S19.9.2), suspended pavement/modular structures (C753 S19.2.2, S19.2.3, S19.9.3) or linked tree pits to provide adequate shared rooting volume. Ensure good aeration and drainage from the pit base to prevent waterlogging (unless water-tolerant species selected). Consider permeable surfaces around pits. If functioning as SuDS, design inlets for surface water entry (C753 S19.8.3).\"]},{\"heading\":\"Soil Specification (C753 S19.9; GI Guide - Soils)\",\"content\":[\"Use good quality topsoil (e.g., BS 3882:2015, low fertility may be preferred for some biodiversity goals) or specified engineered/structural soils appropriate for the pit type and load-bearing requirements. Ensure adequate aeration, drainage, water retention, and appropriate nutrient levels/pH for selected species. Avoid soil compaction during installation.\"]},{\"heading\":\"Planting (C753 S19.11)\",\"content\":[\"Follow BS 8545:2014. Select healthy stock (consider biosecurity). Plant at correct depth (root collar visible). Ensure good rootball-soil contact. Backfill carefully without compacting root zone.\"]},{\"heading\":\"Support, Protection & Irrigation (C753 S19.11)\",\"content\":[\"Use appropriate staking only if necessary for stability, ensuring ties are flexible and non-abrasive; remove promptly after establishment (2-3 years) to allow natural trunk development. Install robust tree guards (metal/plastic mesh) and potentially grilles in paved areas to protect against vandalism, vehicle impact, and strimmer damage. Consider root barriers near sensitive infrastructure. Watering is vital for establishment (first 2-3 growing seasons), especially in paved environments; use watering tubes/bags or design for passive irrigation via SuDS linkage.\"]},{\"heading\":\"Aftercare & Maintenance (C753 S19.12)\",\"content\":[\"Apply mulch (coarse bark/woodchip, 50-75mm deep) around base (not touching trunk) to conserve moisture and suppress weeds. Carry out formative pruning if needed. Regularly inspect tree health, stability, guards/stakes, and irrigation (if used). Manage surrounding vegetation/weeds.\"]}],\"productsNeeded\":[\"tree-std-bare-root-01\",\"tree-std-root-ball-01\",\"topsoil-bs3882-01\",\"struct-soil-01\",\"tree-stake-kit-01\",\"tree-guard-mesh-01\",\"gr-root-barrier-01\",\"mulch-bark-01\",\"irrigation-pipe-01\"],\"furtherReading\":[{\"title\":\"The SuDS Manual (CIRIA C753)\",\"url\":\"https://www.ciria.org/ItemDetail?iProductCode=C753F\"},{\"title\":\"Trees and Design Action Group (TDAG)\",\"url\":\"https://www.tdag.org.uk/guidance.html\"},{\"title\":\"BS 8545:2014 Trees: from nursery to independence in the landscape\",\"url\":\"https://knowledge.bsigroup.com/products/trees-from-nursery-to-independence-in-the-landscape-recommendations/standard\"}]}"
    },
    {
      "key": "suds_enabled_street_trees",
      "value": "{\"id\":\"suds_enabled_street_trees\",\"name\":\"SuDS-Enabled Street Trees\",\"summary\":\"Street tree pits designed to receive and manage runoff from surrounding impermeable areas, providing attenuation, treatment, and passive irrigation.\",\"sources\":\"CIRIA C753 Ch 19.8.3, Susdrain Tree Pit Guidance\",\"benefits\":[{\"category\":\"Water Management\",\"text\":\"Enhanced Runoff Volume Reduction (infiltration/storage); Peak Flow Attenuation; Water Quality Improvement (filtration/uptake); Passive Irrigation for tree. (C753 S19.8.3)\"},{\"category\":\"Climate Regulation\",\"text\":\"Benefits as per standard street trees, potentially enhanced by better water availability.\"},{\"category\":\"Air Quality\",\"text\":\"As per standard street trees.\"},{\"category\":\"Biodiversity\",\"text\":\"As per standard street trees, potentially enhanced habitat.\"},{\"category\":\"Amenity & Well-being\",\"text\":\"As per standard street trees.\"},{\"category\":\"Resilience\",\"text\":\"Improved tree health and drought tolerance due to passive watering.\"}],\"technicalGuidance\":[{\"heading\":\"Design Principles (C753 S19.8.3)\",\"content\":[\"Integrate SuDS functionality into standard tree pit design. Aim to capture runoff from adjacent pavements/roads. Calculate contributing catchment area and runoff volume to size pit appropriately. Design requires hydraulic, structural, and horticultural considerations.\"]},{\"heading\":\"Pit Construction & Inlet\",\"content\":[\"Typically larger pit volume than standard tree pit to provide storage. Use structural soil or suspended pavement systems for load bearing under paving. Incorporate inlet (e.g., permeable paving edge, trench drain, weir inlet, grated inlet) allowing water entry without clogging. Ensure appropriate overflow mechanism.\"]},{\"heading\":\"Filtration & Drainage\",\"content\":[\"Use filter layers (geotextile, sand/gravel) to prevent soil fines washing out. Include drainage layer at base (aggregate, drainage board) connected to underdrain or allowed to infiltrate (if ground conditions suitable - C753 Ch 25). Underdrain connects to downstream drainage system.\"]},{\"heading\":\"Soil & Planting\",\"content\":[\"Use specified structural/engineered soil media capable of supporting load, allowing root growth, filtration, and water retention. Select tree species tolerant of occasional waterlogging and urban conditions.\"]},{\"heading\":\"Maintenance (C753 S19.12)\",\"content\":[\"Requires standard tree maintenance plus specific SuDS checks: Inspect and clear inlets/outlets regularly to prevent blockage by sediment/litter. Check overflow function. Monitor tree health.\"]}],\"productsNeeded\":[\"tree-std-bare-root-01\",\"tree-std-root-ball-01\",\"struct-soil-01\",\"suds-aggregate-01\",\"geo-permeable-01\",\"irrigation-pipe-01\",\"suds-filter-media-01\",\"tree-stake-kit-01\",\"gr-root-barrier-01\"],\"furtherReading\":[{\"title\":\"The SuDS Manual (CIRIA C753)\",\"url\":\"https://www.ciria.org/ItemDetail?iProductCode=C753F\"},{\"title\":\"Susdrain - SuDS Tree Pits\",\"url\":\"https://www.susdrain.org/delivering-suds/using-suds/suds-components/source-control/trees.html\"}]}"
    },
    {
      "key": "green_roof_extensive",
      "value": "{\"id\":\"green_roof_extensive\",\"name\":\"Extensive Green Roof\",\"summary\":\"Thin layer of vegetation (<150mm substrate) on a roof, low maintenance, typically non-accessible. Often sedum or wildflowers.\",\"sources\":\"IGNITION, NE GIDG 4.5, CIRIA C753 Ch 12, GI Design Guide, GRO Code\",\"benefits\":[{\"category\":\"Water Management\",\"text\":\"High Runoff Volume Reduction via storage & evapotranspiration (Interception); Peak Flow Attenuation (moderate); Water Quality Improvement (filtration). (C753 S12.4, S12.5)\"},{\"category\":\"Building Performance\",\"text\":\"Thermal Insulation (reduced energy use - C753 S12.1); Increased roof lifespan (protection from UV/thermal stress); Noise Reduction/acoustic insulation (11 db). (GI Guide)\"},{\"category\":\"Environmental\",\"text\":\"Urban Cooling/Mitigates Urban Heat Island Effect (GI Guide); Air Quality Improvement (particulate capture); Carbon Sequestration/Storage (C753 Ch 5).\"},{\"category\":\"Biodiversity\",\"text\":\"Creates habitat, esp. for invertebrates; Can support specific target habitats (e.g., simulating brownfield sites); Contributes to ecological networks (stepping stone habitat). (C753 S12.7; GI Guide)\"},{\"category\":\"Amenity\",\"text\":\"Improves visual appearance of roofs (esp. if overlooked). (C753 S12.6)\"},{\"category\":\"Metrics\",\"text\":\"Rainwater Runoff Retained: 62%; Stormwater Runoff Delay: 73%; Surface Temperature Reduction: 6.5°C; Air Temperature Reduction (Above): 0.8°C; Carbon Sequestered: 1.28 kg/m²/yr; Carbon Stored (Veg): 0.375 kg/m²; Air Pollutant Removal (NO2): 24%; Air Pollutant Removal (PM10): 14%; Water Quality (NO3 Reduction): 80%; Water Quality (TSS Reduction): 70%; Water Quality (P Reduction): 67%; Property Value Uplift (Non-Accessible): 2.9%.\"}],\"technicalGuidance\":[{\"heading\":\"Structural Assessment (C753 S12.2)\",\"content\":[\"CRITICAL FIRST STEP. Existing roof structure MUST be assessed by a qualified structural engineer for load-bearing capacity. Extensive green roofs add saturated weight (typically 60-150 kg/m²). Assessment must confirm capacity for dead load (system + vegetation) + live load (snow, maintenance access).\"]},{\"heading\":\"Waterproofing & Root Barrier (C753 S12.8)\",\"content\":[\"Existing roof waterproofing must be in excellent condition, appropriately detailed, and ideally root-resistant (FLL certified). If not, a separate root barrier layer (e.g., HDPE) MUST be installed over the waterproofing. Protection fleece often recommended above root barrier/waterproofing.\"]},{\"heading\":\"Roof Slope & Stability (C753 S12.2)\",\"content\":[\"Suitable for flat roofs or slopes up to 10-15 degrees standard build-up. Steeper slopes (>9 degrees) require specific retention measures (e.g., battens, shear barriers, geocells) to prevent substrate slippage, designed by a specialist.\"]},{\"heading\":\"Drainage Layer (C753 S12.8.3)\",\"content\":[\"Essential layer to allow excess water drainage and aeration. Typically cuspated (dimpled) sheets (e.g., HDPE), drainage/reservoir boards, or lightweight aggregate. Ensure sufficient flow capacity.\"]},{\"heading\":\"Filter Layer (C753 S12.8.4)\",\"content\":[\"Geotextile filter fleece placed above the drainage layer to prevent substrate fines washing out and clogging the drainage void/outlets. Must be permeable and filter-stable.\"]},{\"heading\":\"Growing Medium/Substrate (C753 S12.9; GI Guide - Soils)\",\"content\":[\"Use lightweight, engineered extensive green roof substrate (typically 60-150mm deep). MUST meet standards (e.g., FLL guidelines/GRO Code or equivalent UK specs - C753 S30.4) for particle size, bulk density, water retention, air capacity, organic content, pH. Do NOT use standard topsoil. Consider substrate variation for biodiversity (GI Guide).\"]},{\"heading\":\"Vegetation (C753 S12.10; GI Guide - Planting)\",\"content\":[\"Primarily drought-tolerant, low-growing, low-maintenance species adapted to shallow, exposed conditions. Sedums common (often pre-grown mats/blankets for ease). Can include drought-tolerant herbs, grasses, and UK native wildflowers/plugs suitable for extensive roofs (e.g., Kidney Vetch, Biting Stonecrop, Sheep's Fescue, Wild Marjoram, Thyme). Match species to substrate depth and biodiversity goals (GRO Code).\"]},{\"heading\":\"Edge Detail & Fire Breaks (C753 S12.8.1)\",\"content\":[\"Install vegetation-free margins (min 300-500mm) of rounded gravel/pebbles or paving slabs around perimeters, rooflights, penetrations, and potentially compartmenting large roofs (>40m - C753 S12.8.1). Essential for drainage access and fire safety (compliance with Building Regs Part B & GRO Code). Use appropriate edge profiles/retainer trims.\"]},{\"heading\":\"Installation (C753 S12.11)\",\"content\":[\"Install layers sequentially: waterproofing, root barrier (if needed), protection fleece, drainage layer, filter fleece, substrate, vegetation. Follow GRO Code and manufacturer/system supplier guidelines precisely. Protect layers during installation. Ensure safe working practices (working at height).\"]},{\"heading\":\"Maintenance (C753 S12.12; GRO Code)\",\"content\":[\"Low but essential (esp. establishment). Typically 1-2 visits/year after establishment. Includes: removing unwanted vigorous weeds (esp. tree seedlings), checking/clearing outlets and margins, applying slow-release fertiliser ONLY if deficiency observed (often unnecessary for sedum - check GRO Code), watering ONLY during establishment phase or prolonged extreme drought.\"]}],\"productsNeeded\":[\"gr-root-barrier-01\",\"gr-drainage-layer-01\",\"gr-filter-fleece-01\",\"gr-ext-substrate-01\",\"gr-sedum-mat-01\",\"wildflower-seed-mix-01\",\"gr-edge-trim-01\",\"gr-pebble-ballast-01\"],\"furtherReading\":[{\"title\":\"The SuDS Manual (CIRIA C753)\",\"url\":\"https://www.ciria.org/ItemDetail?iProductCode=C753F\"},{\"title\":\"UK Green Roof Organisation (GRO) Code\",\"url\":\"https://livingroofs.org/uk-green-roof-code/\"}]}"
    },
    {
      "key": "green_roof_intensive",
      "value": "{\"id\":\"green_roof_intensive\",\"name\":\"Intensive Green Roof\",\"summary\":\"Deeper soil layer (>150mm substrate), often accessible as a roof garden/park, supporting diverse planting including shrubs and trees. Higher maintenance than extensive roofs.\",\"sources\":\"IGNITION, NE GIDG 4.5, CIRIA C753 Ch 12, GI Design Guide\",\"benefits\":[{\"category\":\"Water Management\",\"text\":\"Very High Runoff Volume Reduction; High Peak Flow Attenuation; Enhanced Water Quality Improvement. (C753 S12.4, S12.5)\"},{\"category\":\"Building Performance\",\"text\":\"Enhanced Thermal Insulation; Increased roof lifespan; High Noise Reduction/acoustic insulation (46 db). (GI Guide)\"},{\"category\":\"Environmental\",\"text\":\"Enhanced Urban Cooling; Enhanced Air Quality Improvement; Higher Carbon Sequestration/Storage potential. (C753 Ch 5; GI Guide)\"},{\"category\":\"Biodiversity\",\"text\":\"Creates diverse habitats (meadow, shrub, woodland edge analogue); Supports wider range of species; Contributes significantly to ecological networks. (C753 S12.7; GI Guide)\"},{\"category\":\"Amenity\",\"text\":\"Creates accessible recreational/amenity space (roof garden/park); High aesthetic value. (C753 S12.6)\"},{\"category\":\"Metrics\",\"text\":\"Energy Saving (Below): 6.7% (or better); Surface Temperature Reduction: 14.5°C; Air Temperature Reduction (Above): 1.1°C; Property Value Uplift (Accessible): 6.9%; (Carbon sequestration/storage and water quality benefits likely higher than extensive roofs)\"}],\"technicalGuidance\":[{\"heading\":\"Structural Assessment (C753 S12.2)\",\"content\":[\"EVEN MORE CRITICAL. Intensive systems impose very high saturated loads (180-500+ kg/m², potentially >>1000 kg/m² with trees/deep substrate/water features). Detailed structural engineering assessment and specific design/strengthening of the roof structure are essential. Load calculations must account for all components (substrate, vegetation - mature weight, paving, water features, furniture, soil water retention), plus snow and live loads (occupants, maintenance).\"]},{\"heading\":\"Waterproofing & Root Barrier (C753 S12.8)\",\"content\":[\"Requirements are stricter than extensive roofs. Use high-performance, robust, root-resistant waterproofing membranes (FLL certified) or standard membrane plus separate heavy-duty root barrier (e.g., HDPE >0.8mm). Meticulous detailing, protection during installation, and integrity testing (flood test) strongly recommended before overlaying.\"]},{\"heading\":\"Drainage & Irrigation (C753 S12.8.3)\",\"content\":[\"High-capacity drainage layer (e.g., deeper drainage/reservoir boards, aggregate layers) essential. Automated irrigation system (drip, sprinklers) nearly always required for diverse planting in UK climate. Requires reliable water supply, adequate pressure, filtration, control unit, potential fertigation and frost protection. Design for efficient water use. Ensure robust, accessible outlets/inspection chambers.\"]},{\"heading\":\"Growing Medium/Substrate (C753 S12.9; GI Guide - Soils)\",\"content\":[\"Deeper engineered intensive substrate (150mm to >1m). Careful specification needed (meet FLL/GRO Code) balancing water retention, aeration, drainage, stability, nutrient content, and weight minimisation. Use different depths/types for different planting zones (e.g., deeper under trees/shrubs).\"]},{\"heading\":\"Vegetation (C753 S12.10; GI Guide - Planting)\",\"content\":[\"Wide planting palette: lawns (requires maintenance/irrigation), perennials, grasses, shrubs, small trees (subject to structural/substrate constraints). Select species suitable for roof conditions (exposure, depth), desired aesthetic, maintenance level, and biodiversity goals. Use UK natives where appropriate.\"]},{\"heading\":\"Hard Landscaping & Features (C753 S12.6)\",\"content\":[\"Integrate paving, seating, planters, lighting, water features etc., carefully considering load implications, drainage, waterproofing interfaces, material durability, and accessibility compliance (Building Regs Part M).\"]},{\"heading\":\"Edge Detail & Safety (C753 S12.2, S12.8.1; GI Guide)\",\"content\":[\"Robust edge protection (parapets, railings meeting BS 6180) essential for accessible roofs. Vegetation-free margins still required for fire safety and drainage. Consider wind loading on structures/tall planting.\"]},{\"heading\":\"Maintenance (C753 S12.12)\",\"content\":[\"Significantly higher than extensive roofs, akin to ground-level gardens/parks. Requires regular mowing, weeding, pruning, irrigation checks/adjustment, feeding, pest/disease control, structural checks, outlet clearing. Specialist horticultural knowledge often needed.\"]}],\"productsNeeded\":[\"gr-root-barrier-01\",\"gr-drainage-layer-01\",\"gr-filter-fleece-01\",\"gr-int-substrate-01\",\"park-shrub-mix-01\",\"irrigation-pipe-01\",\"gr-pebble-ballast-01\",\"park-bench-01\"],\"furtherReading\":[{\"title\":\"The SuDS Manual (CIRIA C753)\",\"url\":\"https://www.ciria.org/ItemDetail?iProductCode=C753F\"},{\"title\":\"UK Green Roof Organisation (GRO) Code\",\"url\":\"https://livingroofs.org/uk-green-roof-code/\"}]}"
    },
    {
      "key": "green_wall_living",
      "value": "{\"id\":\"green_wall_living\",\"name\":\"Living Wall\",\"summary\":\"Vegetation growing on a vertical module/system attached to a wall, often with integrated irrigation. Offers significant GI benefits but minimal direct SuDS function.\",\"sources\":\"IGNITION, NE GIDG 4.6, GI Design Guide\",\"benefits\":[{\"category\":\"Amenity & Aesthetics\",\"text\":\"Transforms building façades, visual interest, potential for 'wow' factor.\"},{\"category\":\"Building Performance\",\"text\":\"Building Temperature Regulation (shading, evaporative cooling, insulation); Noise Reduction (9.8 db); Protects building fabric.\"},{\"category\":\"Environmental\",\"text\":\"Air Quality Improvement (particulate capture, NO2 removal 18-35%); Urban Cooling.\"},{\"category\":\"Biodiversity\",\"text\":\"Provides habitat/foraging for invertebrates, potentially nesting sites for birds if designed appropriately.\"},{\"category\":\"Metrics\",\"text\":\"Energy Saving (Adjacent): 8%; Indoor Temperature Reduction: 4.8°C; Air Temperature Reduction: 0.5-4.1°C; Exterior Wall Temperature Reduction: 3.8°C; Rainwater Runoff Retained: <75%; Water Quality (NO3 Reduction): 30-83%; Water Quality (TSS Reduction): 33-99%; Water Quality (P Reduction): 15-30%; Property Value Uplift: 2.5%.\"}],\"technicalGuidance\":[{\"heading\":\"Structural Assessment\",\"content\":[\"Supporting wall MUST be assessed by structural engineer for load (system weight, saturated substrate, vegetation, wind load - can be 50-100+ kg/m²).\"]},{\"heading\":\"Wall Condition & Waterproofing\",\"content\":[\"Underlying wall must be sound. Ensure system design includes adequate waterproofing/protection for the building fabric, often with a ventilated cavity behind the system.\"]},{\"heading\":\"System Selection\",\"content\":[\"Choose system (modular panels, felt pockets, troughs on frame) based on scale, budget, aspect (sun/shade), plant choice, maintenance capacity. Consider system lifespan, fire resistance (Building Regs Part B), guarantees.\"]},{\"heading\":\"Mounting & Framework\",\"content\":[\"Secure fixing to structural wall essential, follow manufacturer/engineer specs. Ensure appropriate fixings for wall type. Ventilation cavity usually required behind system for wall health.\"]},{\"heading\":\"Irrigation & Drainage\",\"content\":[\"Automated irrigation (usually drip) is ESSENTIAL. Requires reliable water supply (often mains), pressure regulation, filtration, controller, possibly frost protection and nutrient dosing (fertigation). Manage drainage at base to collect runoff (gutter/planter) and connect to drainage system (C753 Ch 28 principles) - prevent damage/staining below. Rainwater harvesting (C753 Ch 11) can supplement irrigation water.\"]},{\"heading\":\"Growing Medium\",\"content\":[\"Use specialist lightweight, stable, free-draining vertical growing media/substrate appropriate for the system.\"]},{\"heading\":\"Plant Selection (GI Guide - Planting)\",\"content\":[\"Choose species adapted to vertical growth, system type, light/wind exposure, UK climate. Consider maintenance needs, desired aesthetic (evergreen/deciduous mix, texture, colour). UK natives possible (ferns, ivies, bellflowers, thyme, sedums) but often mixed with suitable non-natives.\"]},{\"heading\":\"Installation\",\"content\":[\"Follow manufacturer's instructions precisely for all components (frame, panels, irrigation, planting, commissioning).\"]},{\"heading\":\"Maintenance (GI Guide - Maintenance)\",\"content\":[\"High and regular specialist maintenance required. Includes irrigation checks/adjustment (vital), pruning, plant replacement, feeding/nutrient management, pest/disease control, structural checks. Failure to maintain irrigation will lead to rapid plant death.\"]}],\"productsNeeded\":[\"lw-modular-panel-01\",\"lw-irrigation-kit-01\",\"lw-substrate-01\",\"lw-plants-plug-01\"],\"furtherReading\":[{\"title\":\"Natural England Green Infrastructure Design Guide\",\"url\":\"https://designatedsites.naturalengland.org.uk/GreenInfrastructure/Home.aspx\"}]}"
    },
    {
      "key": "green_wall_facade",
      "value": "{\"id\":\"green_wall_facade\",\"name\":\"Green Façade\",\"summary\":\"Climbing plants growing directly on or against a wall, potentially using a support structure. Lower cost and maintenance greening option compared to living walls.\",\"sources\":\"IGNITION, NE GIDG 4.6, GI Design Guide\",\"benefits\":[{\"category\":\"Amenity & Aesthetics\",\"text\":\"Softens building appearance, seasonal interest (flowers, colour).\"},{\"category\":\"Building Performance\",\"text\":\"Building Temperature Regulation: Shading, some evaporative cooling, insulation (C753 Ch 5).\"},{\"category\":\"Environmental\",\"text\":\"Air Quality Improvement: Minor particulate capture (C753 Ch 5).\"},{\"category\":\"Biodiversity\",\"text\":\"Provides habitat for invertebrates, nesting/roosting sites for birds/bats (Ivy).\"},{\"category\":\"Metrics\",\"text\":\"Energy Saving (Cooling): 15%; Indoor Temperature Reduction: 2.7°C; Air Temperature Reduction: 1-3°C; Exterior Wall Temperature Reduction: 3°C; Noise Reduction: 2.6 db; Property Value Uplift: 2.5% (Assumed similar to Living Wall).\"}],\"technicalGuidance\":[{\"heading\":\"Wall Assessment\",\"content\":[\"Check structural integrity and surface condition (esp. mortar joints for self-clingers). Ensure wall is weather-tight. Self-clinging climbers (e.g., Ivy, Virginia Creeper, Climbing Hydrangea) require sound surfaces they can grip; manage growth to avoid damage to windows/roofs/render.\"]},{\"heading\":\"Support Structure (If Required - GI Guide)\",\"content\":[\"For twining/scrambling climbers (e.g., Honeysuckle, Jasmine, Clematis, Wisteria, Roses), a support structure (trellis, wires, mesh) is essential. Fix securely with appropriate wall fixings, using stand-off brackets (50-100mm+) to create an air gap for plant/wall health & maintenance (C753 Ch 29 principles). Ensure structure suits plant type and can support mature weight + wind load.\"]},{\"heading\":\"Planting Location (GI Guide - Planting)\",\"content\":[\"Plant climbers at base in prepared ground (improve soil with compost, ensure good drainage) or large, deep containers suitable for mature size. Position away from drains/foundations where possible.\"]},{\"heading\":\"Plant Selection (GI Guide - Planting)\",\"content\":[\"Choose climbers appropriate for aspect (sun/shade), wall height, support type (self-clinging vs. needing support), desired effect (evergreen/deciduous, flowers, autumn colour), growth rate/vigour, and UK climate. Consider UK natives (Ivy, Honeysuckle) for biodiversity. Be mindful of vigour (e.g., Wisteria, Russian Vine need strong support/regular pruning). Check for potential allergenicity or toxicity if publicly accessible.\"]},{\"heading\":\"Training & Pruning (GI Guide - Maintenance)\",\"content\":[\"Guide young shoots onto supports. Regular pruning (annually or biannually, species dependent) needed to control size/shape, encourage flowering, remove deadwood, prevent obstruction (windows, gutters, vents).\"]},{\"heading\":\"Watering & Feeding\",\"content\":[\"Water regularly during establishment (first 1-2 years) and dry spells, esp. container plants. Feed annually in spring (general-purpose fertiliser) or as needed.\"]},{\"heading\":\"Maintenance (GI Guide - Maintenance)\",\"content\":[\"Lower than living walls. Primarily annual pruning, training, checking/maintaining supports, occasional pest/disease management. Self-clingers require monitoring to prevent wall/mortar damage.\"]}],\"productsNeeded\":[\"gf-climber-plant-01\",\"gf-support-wire-01\",\"gf-wire-tensioner-01\",\"gf-wall-bracket-01\",\"topsoil-bs3882-01\"],\"furtherReading\":[{\"title\":\"RHS Advice - Climbers and Wall Shrubs\",\"url\":\"https://www.rhs.org.uk/advice/grow-your-own/vines-wall-shrubs\"}]}"
    },
    {
      "key": "urban_park_greenspace",
      "value": "{\"id\":\"urban_park_greenspace\",\"name\":\"Urban Park / Green Space\",\"summary\":\"Amenity areas covered with vegetation, ranging from playing fields to diverse natural landscapes. Vital Green Infrastructure providing multiple ecosystem services.\",\"sources\":\"IGNITION, NE GIDG 4.16, CIRIA C753 Ch 5/6/29, GI Design Guide\",\"benefits\":[{\"category\":\"Social & Health\",\"text\":\"Recreation space (formal/informal play, sports); Improved physical & mental well-being; Social interaction; Educational opportunities (C753 Ch 5; GI Guide).\"},{\"category\":\"Environmental\",\"text\":\"Air Quality Improvement (pollutant capture); Urban Cooling / Climate Regulation (2.7°C daytime temp reduction); Noise Reduction (4 db/m²); Carbon Sequestration & Storage (C753 Ch 5; GI Guide).\"},{\"category\":\"Water Management\",\"text\":\"High Rainwater Runoff Retention (84.2%); Significant Interception & Infiltration potential (30% annual rainfall); Water Quality Improvement (TSS, Nutrient, Metal reduction via soil/plants) (C753 Ch 3, Ch 4).\"},{\"category\":\"Biodiversity\",\"text\":\"Creates core habitat areas; Supports diverse species (plants, invertebrates, birds, mammals); Improves ecological connectivity (C753 Ch 6; GI Guide).\"},{\"category\":\"Economic\",\"text\":\"Property Value Uplift (Proximity): 9.5%; Potential tourism/event revenue (GI Guide).\"}],\"technicalGuidance\":[{\"heading\":\"Masterplanning & Concept (C753 Ch 7; GI Guide)\",\"content\":[\"Define primary functions (recreation, biodiversity, flood storage etc.) and desired character. Identify opportunities to manage runoff from within the park and adjacent areas via integrated SuDS features (swales, ponds, rain gardens, permeable paths). Consider topography, existing features (protect valuable habitats/trees), accessibility, and connectivity to wider GI networks. Engage community early (C753 Ch 34). Address Biodiversity Net Gain requirements.\"]},{\"heading\":\"Site Assessment (C753 Ch 7; GI Guide)\",\"content\":[\"Assess existing soils (type, structure, contamination - C753 Ch 8.2), infiltration potential (C753 Ch 25), groundwater levels (C753 Ch 8.3), topography, ecology, heritage, utilities.\"]},{\"heading\":\"Water Quantity Management (C753 Ch 3)\",\"content\":[\"Maximise runoff volume reduction (Interception - C753 Ch 24.8) via soil storage, infiltration (where suitable), and evapotranspiration (planting design). Provide attenuation storage in multi-functional basins (Ch 22 - e.g., sports pitches) or ponds/wetlands (Ch 23). Ensure safe management of exceedance flows (C753 Ch 24.12), using pathways or low points.\"]},{\"heading\":\"Water Quality Management (C753 Ch 4, Ch 26)\",\"content\":[\"Utilise vegetated SuDS components (swales, filter strips, bioretention, wetlands) for treatment. Protect sensitive features (ponds, infiltration areas) with upstream pre-treatment (e.g., forebays, filter strips - C753 Ch 15, Ch 28). Design to manage pollutants appropriate to runoff sources.\"]},{\"heading\":\"Amenity & Recreation Design (C753 Ch 5, Ch 29; GI Guide)\",\"content\":[\"Integrate SuDS aesthetically. Design safe, accessible paths (consider permeable options - C753 Ch 20), seating, play areas, water features. Ensure safety around water (C753 Ch 36). Provide interpretation/education opportunities.\"]},{\"heading\":\"Biodiversity & Habitat Design (C753 Ch 6, Ch 29; GI Guide)\",\"content\":[\"Create diverse habitats: meadows, woodland/scrub, wetlands, ponds. Use native UK species appropriate for site conditions. Create structural diversity (varied planting heights, deadwood - C753 S6.3). Link habitats internally and connect to external corridors. Minimise impacts of lighting.\"]},{\"heading\":\"Soil Management (C753 Ch 29.5, Ch 30.4; GI Guide - Soils)\",\"content\":[\"Protect/reuse existing topsoil. Import appropriate soils (e.g., BS 3882:2015) or create specific substrates (low fertility for meadows). Decompact subsoils before topsoiling, especially in construction traffic areas or where infiltration is desired.\"]},{\"heading\":\"Planting & Establishment (C753 Ch 29.6, Ch 29.7; GI Guide - Planting)\",\"content\":[\"Select robust, appropriate species (UK native priority) for different zones/habitats. Ensure good ground preparation, planting techniques (BS 8545 for trees), and establishment watering/aftercare.\"]},{\"heading\":\"Maintenance (C753 Ch 32; GI Guide - Maintenance)\",\"content\":[\"Develop long-term management plan with differentiated regimes (amenity mowing, meadow cuts, woodland management, SuDS feature checks - inlet/outlet clearing, sediment removal). Ensure funding and responsibilities are clear.\"]}],\"productsNeeded\":[\"topsoil-bs3882-01\",\"tree-std-root-ball-01\",\"park-shrub-mix-01\",\"wildflower-seed-mix-01\",\"park-bench-01\",\"litter-bin-01\",\"mulch-bark-01\",\"wildlife-pond-liner-01\",\"wildlife-log-pile-01\",\"geo-permeable-01\"],\"furtherReading\":[{\"title\":\"The SuDS Manual (CIRIA C753)\",\"url\":\"https://www.ciria.org/ItemDetail?iProductCode=C753F\"},{\"title\":\"Natural England Green Infrastructure Guidance\",\"url\":\"https://designatedsites.naturalengland.org.uk/GreenInfrastructure/Home.aspx\"}]}"
    },
    {
      "key": "suds_general",
      "value": "{\"id\":\"suds_general\",\"name\":\"SuDS (General - Swale/Filter Strip)\",\"summary\":\"Sustainable Drainage Systems like swales or filter strips to manage surface water conveyance and provide treatment.\",\"sources\":\"IGNITION, NE GIDG 4.4, 4.8, CIRIA C753 Ch 15 & 17, GI Design Guide\",\"benefits\":[{\"category\":\"Water Management\",\"text\":\"Conveyance; Attenuation (esp. with check dams); Water Quality Improvement (TSS, Nutrients, Metals via filtration/sedimentation); Infiltration (if unlined); Interception. (C753 Ch 3, Ch 4, Ch 15, Ch 17)\"},{\"category\":\"Environmental\",\"text\":\"Carbon Sequestration & Storage; Potential for Urban Cooling (evapotranspiration).\"},{\"category\":\"Biodiversity\",\"text\":\"Creates linear habitat (grassland, wetland edge); Supports invertebrates, potentially amphibians/reptiles; Improves habitat connectivity. (C753 Ch 6; GI Guide)\"},{\"category\":\"Amenity\",\"text\":\"Enhances landscape/streetscape visual quality; Can be integrated with paths/recreation areas. (C753 Ch 5; GI Guide)\"},{\"category\":\"Metrics\",\"text\":\"Rainwater Runoff Retained: 69%; Stormwater Runoff Delay: 57%; Water Quality Improvement (TSS, NO3, P - variable); Carbon Sequestered: 0.27 kg/m²/yr; Carbon Stored: 3.05-5.04 kg/m²; Amenity & Biodiversity Enhancement; Property Value Uplift (Nearby Water): 0.9-3.6%.\"}],\"technicalGuidance\":[{\"heading\":\"Filter Strips (C753 Ch 15)\",\"content\":[\"Function: Pre-treatment via filtration/sedimentation for sheet flow from adjacent impermeable areas (roads, car parks). Some infiltration/Interception.\",\"Design: Gentle slope (1-5%, 1:100-1:20), dense vegetation (grass). Min. 5m flow path for treatment (C753 S15.5). Requires level spreader inlet for sheet flow (C753 S15.8.1), ensure min. 50mm drop from hard surface to prevent sediment blocking inflow.\",\"Maintenance: Regular mowing, sediment removal from upstream edge (C753 S15.12).\"]},{\"heading\":\"Swales (C753 Ch 17)\",\"content\":[\"Function: Conveyance, attenuation, treatment (filtration/sedimentation), infiltration (if unlined), biodiversity. Types: Conveyance, Dry/Enhanced (underdrained), Wet.\",\"Design: Shallow, broad channel (base 0.5-2m typ.), gentle longitudinal slope (0.5-3% typ., max 6%). Use check dams >3% slope (C753 S17.2, S17.9.2) to slow flow, increase residence time & infiltration. Side slopes max 1:3 for maintenance/safety (C753 S17.2). Ensure capacity for design flow (e.g., 1:30yr) & safe exceedance (Ch 24.12). Underdrains for slopes <1.5% or poor infiltration (dry swale - C753 S17.1.2). Wet swales for flat sites/high water table (C753 S17.1.3).\",\"Treatment: Requires flow velocity <0.5 m/s & residence time >9 mins for water quality event (C753 S17.4.1).\",\"Vegetation: Dense grass cover essential (C753 S17.10). Species tolerant of periodic inundation (dry swales) or permanent wetness (wet swales). Native species enhance biodiversity (GI Guide).\",\"Maintenance: Regular mowing (dry swales), vegetation management (wet swales), inspection/clearing of inlets/outlets/check dams, sediment removal (C753 S17.12).\"]},{\"heading\":\"General Considerations (C753 & GI Guide)\",\"content\":[\"Assess site suitability (slope, soils, groundwater - C753 Ch 8). Integrate into landscape design and GI network. Protect during construction (C753 Ch 31). Ensure correct soil specification/handling (C753 Ch 29.5, Ch 30.4). Design inlets/outlets carefully (C753 Ch 28). Consider long-term management (C753 Ch 32)."]}],\"productsNeeded\":[\"wildflower-seed-mix-01\",\"topsoil-bs3882-01\",\"suds-filter-media-01\",\"geo-permeable-01\",\"irrigation-pipe-01\",\"suds-aggregate-01\",\"erosion-mat-jute-01\"],\"furtherReading\":[{\"title\":\"The SuDS Manual (CIRIA C753)\",\"url\":\"https://www.ciria.org/ItemDetail?iProductCode=C753F\"},{\"title\":\"Susdrain - Components\",\"url\":\"https://www.susdrain.org/delivering-suds/using-suds/suds-components/\"}]}"
    },
    {
      "key": "wildlife_features_new_dev",
      "value": "{\"id\":\"wildlife_features_new_dev\",\"name\":\"Wildlife Features in New Developments\",\"summary\":\"Strategic approach to embedding biodiversity features (e.g., native planting, ponds, nest boxes, hedgehog highways) into new developments, integrated with SuDS and Green Infrastructure planning.\",\"sources\":\"LNRS, GI Design Guide, C753 Ch 6\",\"benefits\":[{\"category\":\"Biodiversity\",\"text\":\"Creates new habitats; Supports diverse native species; Increases species abundance & richness; Improves habitat connectivity & resilience; Essential for delivering Biodiversity Net Gain (BNG).\"},{\"category\":\"Ecosystem Services\",\"text\":\"Pollination; Pest control; Soil formation; Water purification (if linked with SuDS); Climate regulation (microclimate).\"},{\"category\":\"Social & Amenity\",\"text\":\"Enhances aesthetic appeal & sense of place; Provides opportunities for nature connection & education; Improves mental health & well-being.\"},{\"category\":\"Economic\",\"text\":\"Can increase property desirability & value.\"}],\"technicalGuidance\":[{\"heading\":\"Strategic Planning (C753 Ch 7; GI Guide)\",\"content\":[\"Integrate biodiversity from earliest masterplanning stages (RIBA Stage 0/1). Conduct ecological surveys (Phase 1 Habitat / protected species) to identify existing features for retention/enhancement (veteran trees, hedges, ponds). Map connections to off-site GI/habitats. Define BNG strategy using Defra metric. Consult local planning policies (Local Plans, SPDs, LNRS).\"]},{\"heading\":\"Habitat Creation & Enhancement (C753 Ch 6, Ch 29; GI Guide)\",\"content\":[\"Planting: Prioritise UK native species of local provenance for trees, hedges, shrubs, wildflowers (C753 S29.6). Select species beneficial to target wildlife (food, shelter, nesting sites). Create structural diversity (layers, varied densities).\",\"Water Features (C753 Ch 23): Incorporate wildlife ponds/wetlands where feasible. Design with shallow margins (<1:5 slope), varied depths, avoid steep sides. Use native aquatic/marginal plants. Consider temporary water bodies (scrapes/ephemeral pools). Avoid introducing fish or non-native invasive species.\",\"Grassland Management (C753 Ch 29.7): Implement varied mowing: short amenity grass, taller tussocky areas, annual-cut wildflower meadows. Use low-nutrient substrates for meadows.\",\"Deadwood & Shelter (C753 S6.3): Create log piles, rockeries, brash piles using site-won materials where possible for invertebrates, amphibians, reptiles, small mammals. Retain standing deadwood where safe.\",\"SuDS Integration (C753 Ch 6.3): Design SuDS (swales, basins, bioretention, green roofs) explicitly for biodiversity value (native planting, habitat features, varied topography).\"]},{\"heading\":\"Species-Specific Features (GI Guide; C753 Ch 6.3)\",\"content\":[\"Bird/Bat Boxes & Bricks: Integrate various designs into buildings (new builds - consider swift bricks, bat tubes) and mature trees. Position appropriately (aspect, height) for target species.\",\"Hedgehog Highways: Ensure ground-level permeability between gardens/plots via gaps (approx. 13x13cm) in fences/walls/gravel boards.\",\"Insect Habitats: Include bug hotels, bee banks (south-facing sandy banks), log piles, areas of bare ground.\"]},{\"heading\":\"Connectivity (C753 Ch 6.2.3; GI Guide)\",\"content\":[\"Design green spaces (hedges, swales, verges) as corridors linking habitats internally and connecting to off-site GI network. Avoid fragmentation by roads/hard surfacing.\"]},{\"heading\":\"Lighting (GI Guide)\",\"content\":[\"Minimise light pollution impact on wildlife (esp. bats, moths). Use directional, low-intensity, warm-spectrum lighting. Employ shields, timers, motion sensors. Avoid lighting sensitive areas (water bodies, bat routes, hedgerows).\"]},{\"heading\":\"Long-Term Management (C753 Ch 32; GI Guide - Maintenance)\",\"content\":[\"Crucial for success. Develop detailed Landscape and Ecological Management Plan (LEMP) specifying sensitive maintenance regimes (e.g., hedge cutting timings, meadow cuts, pond management) to sustain habitats long-term. Secure funding & responsibility.\"]}],\"productsNeeded\":[\"tree-std-root-ball-01\",\"park-shrub-mix-01\",\"wildflower-seed-mix-01\",\"wildlife-pond-liner-01\",\"wildlife-bird-box-01\",\"wildlife-bat-box-01\",\"wildlife-log-pile-01\"],\"furtherReading\":[{\"title\":\"Natural England Biodiversity Net Gain\",\"url\":\"https://www.gov.uk/government/collections/biodiversity-net-gain\"},{\"title\":\"TCPA/RSPB/Wildlife Trusts - Planning for Biodiversity\",\"url\":\"https://www.tcpa.org.uk/planning-for-a-green-recovery\"}]}"
    }
  ]